Autodesk.Revit.DB.Family.IsParametric
Identifies whether the family contains parametric relations
between some of its elements.
Remarks:
A family is parametric if it contains parameter-driven relations between
its elements, such as labeled dimensions or locked tangential joins.
Parametric families containing large sketches may cause performance
problems. Caution is therefore advised before adding any constraints to
a yet non-parametric family that already contains large sketches.
See Autodesk.Revit.DB.Family.HasLargeSketches.
Since:
2017